print(
    """
            Рантье
    
    Программа подсчитывает Ваши ежесемячные расходы. Эту статистику нужно знать, чтобы у вас не закончились деньги и Вам
    не пришлось бы искать работу.
    Введите суммы расходов по всем статьям, перечисленным ниже. Вы богаты - так не мелочитесь, пишите суммы в долларах,
    без центов.
    
    """
)

car = input("Техническое обслуживание машины 'Chevrolet': ")
rent = input("Съем роскошной квартиры на Лесной: ")
jet = input("Аренда самолета: ")
gifts = input("Подарки: ")
food = input("Обеды и ужины в ресторанах: ")
