# Арсенал героя
# Демонстрирует создание кортежа и работу с кортежем

inventory = ("меч",
             "кольчуга",
             "щит",
             "целебное снадобье")

print("\nИтак, в вашем арсенале: ")
for item in inventory:
    print(item)
print("Сейчас в вашем распоряжении", len(inventory), "предмета/-ов")

index = int(input("\nВведите индекс одного из предметов арсенала: "))
print("Под индексом", index, "в арсенале находится", inventory[index])
if "целебное снадобье" in inventory:
    print("Вы еще  поживете и повоюете, потому что у вас в арсенале имеется", inventory[3], ".")

input("\n\nНажмите Enter, чтобы выйти.")
