# Задание 1
# Считаем в заданном интервале целых чисел

print("Посчитаем!")
x = int(input("Введите начало интервала"))
y = int(input("Введите конец интервала"))
for i in range(x, y):
    print(i, end=" ")
