def instructions():
    print(
        """
        Добро пожаловать на ринг игры Крестики Нолики.
        Чтобы сделать ход, ыыедите число от 0 до 8. Числа
        соответствуют полям, как указано ниже:
        0 | 1 | 2
        ---------
        3 | 4 | 5
        ---------
        6 | 7 | 8
        Приготовься к бою, жалкий людишка. Познай силу процессора!\n    """
    )


print("Это инструкция к игре в 'Крестики-Нолики':")
instructions()
print("Это та же самая инструкция к игре в 'Крестики-Нолики':")
instructions()
print("Надеюсь, теперь смысл игры ясен.")
input("\n\nНажмите Enter, чтобы выйти.")
