# День рождения
# Демонстрирует именованные аргументы и значения параметров по умолчанию
# позиционные параметры

def birthday1(name, age):
    print("С днем рождения, ", name, "!", "Вам сегодня исполняется", age, ", не так ли?\n")


# параметры со значениями по умолчанию

def birthday2(name="Товарищ Иванов", age=37):
    print("С днем рождения, ", name, "!", "Вам сегодня исполняется", age, ", не так ли?\n")


birthday1("Товарищ Иванов", 37)
birthday1(37, "Товарищ Иванов")
birthday1(name="Товарищ Иванов", age=37)
birthday1(age=37, name="Товарищ Иванов")
birthday2()
birthday2(name="Катя")
birthday2(age=12)
birthday2(name="Катя", age=12)
birthday2("Катя", 12)
input("\n\nНажмите Enter, чтобы выйти.")


