import random

print("Я ощущаю вашу энергетику. От моего экрана не скрыто ни одно из ваших чувств.")
print("Итак, Ваше настроение...")
mood = random.randint(1, 3)
if mood == 1:
    print(
        """
        --------
        |      |
        | 0  0 |
        |  <   |
        |  \/  |
        |  '   |
         ------
         """)
elif mood == 2:
    print(
        """
        --------
        |      |
        | 0  0 |
        |  <   |
        | ---  |
        |      |
         ------
         """)
elif mood == 3:
    print(
        """
        --------
        |      |
        | 0  0 |
        |  <   |
        |  .   |
        | / \  |
         ------
         """)
else:
    print("Не бывает такого настроения!")

input("\nНажмите Enter чтобы выйти.")
