# Арсенал героя 3.0
# Демонстрирует работу со списками

inventory = ["меч", "кольчуга", "щит", "целебное снадобье"]

print("\nИтак, в вашем арсенале: ")
for item in inventory:
    print(item)
print("Сейчас в вашем распоряжении", len(inventory), "предмета/-ов")

# index = int(input("\nВведите индекс одного из предметов арсенала: "))
# print("Под индексом", index, "в арсенале находится", inventory[index])
# if "целебное снадобье" in inventory:
#     print("Вы еще  поживете и повоюете, потому что у вас в арсенале имеется", inventory[3], ".")
#
# # отобразим срез
# start = int(input("\nВведите начальный индекс среза: "))
# finish = int(input("\nВведите конечный индекс среза: "))
# print("Срез inventory[", start, ":", finish, "] - это", end=" ")
# print(inventory[start:finish])

# соединим два списка
chest = ["золото", "драгоценные камни"]
# print("Вы нашли ларец, вот что в нем есть: ")
# print(chest)
# print("Вы приобщили содержание ларца к своему арсеналу")
inventory += chest
# print("Теперь у вас в арсенале: ", end=" ")
# print(inventory)

# меняем значение элемента в списке
print("Вы обменяли меч на арбалет.")
inventory[0] = "арбалет"
print("Теперь у вас в распоряжении", inventory)
print("За золото и драгоценные камни вы приобрели магический кристалл, способный предугадывать будущее")
inventory[4:6] = ["магический кристалл"]
print("Теперь у вас в распоряжении", inventory)
print("В тяжелом бою был раздроблен ваш щит")
del inventory[2]
print("Вот что осталось у вас в арсенале:", inventory)
print("Воры украли у вас арбалет и кольчугу")
del inventory[:2]
print("Вот, что осталось у вас в арсенале:", inventory)


input("\n\nНажмите Enter, чтобы выйти.")
